/**
 * @type {([RegExp, string] | [RegExp, string, true])[]}
 */
export default [
    [/^ふぁ/, "fa"],
    [/^ふぃ/, "fi"],
    [/^ふぇ/, "fe"],
    [/^ふぉ/, "fo"],

    [/^うぃ/, "wi"],
    [/^うぇ/, "we"],

    [/^ゔぁ/, "va"],
    [/^ゔぃ/, "vi"],
    [/^ゔ/, "vu"],
    [/^ゔぇ/, "ve"],
    [/^ゔぉ/, "vo"],

    [/^ゔゃ/, "vya"],
    [/^ゔゅ/, "vyu"],
    [/^ゔょ/, "vyo"],

    [/^きゃ/, "kya"],
    [/^きゅ/, "kyu"],
    [/^きぇ/, "kye"],
    [/^きょ/, "kyo"],

    [/^しゃ/, "sha"],
    [/^しゅ/, "shu"],
    [/^しぇ/, "she"],
    [/^しょ/, "sho"],

    [/^ちゃ/, "cha"],
    [/^ちゅ/, "chu"],
    [/^ちぇ/, "che"],
    [/^ちょ/, "cho"],

    [/^つぁ/, "tsa"],
    [/^つぃ/, "tsi"],
    [/^つぇ/, "tse"],
    [/^つぉ/, "tso"],

    [/^にゃ/, "nya"],
    [/^にゅ/, "nyu"],
    [/^にぇ/, "nye"],
    [/^にょ/, "nyo"],

    [/^ひゃ/, "hya"],
    [/^ひゅ/, "hyu"],
    [/^ひぇ/, "hye"],
    [/^ひょ/, "hyo"],

    [/^ふゃ/, "fya"],
    [/^ふゅ/, "fyu"],
    [/^ふょ/, "fyo"],

    [/^みゃ/, "mya"],
    [/^みゅ/, "myu"],
    [/^みぇ/, "mye"],
    [/^みょ/, "myo"],

    [/^りゃ/, "rya"],
    [/^りゅ/, "ryu"],
    [/^りぇ/, "rye"],
    [/^りょ/, "ryo"],

    [/^ぎゃ/, "gya"],
    [/^ぎゅ/, "gyu"],
    [/^ぎぇ/, "gye"],
    [/^ぎょ/, "gyo"],

    [/^じゃ/, "ja"],
    [/^じゅ/, "ju"],
    [/^じぇ/, "je"],
    [/^じょ/, "jo"],

    [/^びゃ/, "bya"],
    [/^びゅ/, "byu"],
    [/^びぇ/, "bye"],
    [/^びょ/, "byo"],

    [/^ぴゃ/, "pya"],
    [/^ぴゅ/, "pyu"],
    [/^ぴぇ/, "pye"],
    [/^ぴょ/, "pyo"],

    [/^てぃ/, "te+i"],
    [/^でぃ/, "de+i"],

    [/^あ/, "a"],
    [/^い/, "i"],
    [/^う/, "u"],
    [/^え/, "e"],
    [/^お/, "o"],

    [/^か/, "ka"],
    [/^き/, "ki"],
    [/^く/, "ku"],
    [/^け/, "ke"],
    [/^こ/, "ko"],

    [/^さ/, "sa"],
    [/^し/, "shi"],
    [/^す/, "su"],
    [/^せ/, "se"],
    [/^そ/, "so"],

    [/^た/, "ta"],
    [/^ち/, "chi"],
    [/^つ/, "tsu"],
    [/^て/, "te"],
    [/^と/, "to"],

    [/^な/, "na"],
    [/^に/, "ni"],
    [/^ぬ/, "nu"],
    [/^ね/, "ne"],
    [/^の/, "no"],

    [/^は/, "ha"],
    [/^ひ/, "hi"],
    [/^ふ/, "fu"],
    [/^へ/, "he"],
    [/^ほ/, "ho"],

    [/^ま/, "ma"],
    [/^み/, "mi"],
    [/^む/, "mu"],
    [/^め/, "me"],
    [/^も/, "mo"],

    [/^や/, "ya"],
    [/^ゆ/, "yu"],
    [/^よ/, "yo"],

    [/^ら/, "ra"],
    [/^り/, "ri"],
    [/^る/, "ru"],
    [/^れ/, "re"],
    [/^ろ/, "ro"],

    [/^わ/, "wa"],
    [/^を/, "wo"],
    [/^ん/, "n'"],

    [/^が/, "ga"],
    [/^ぎ/, "gi"],
    [/^ぐ/, "gu"],
    [/^げ/, "ge"],
    [/^ご/, "go"],

    [/^ざ/, "za"],
    [/^じ/, "ji"],
    [/^ず/, "zu"],
    [/^ぜ/, "ze"],
    [/^ぞ/, "zo"],

    [/^だ/, "da"],
    [/^ぢ/, "dzi"],
    [/^づ/, "dzu"],
    [/^で/, "de"],
    [/^ど/, "do"],

    [/^ば/, "ba"],
    [/^び/, "bi"],
    [/^ぶ/, "bu"],
    [/^べ/, "be"],
    [/^ぼ/, "bo"],

    [/^ぱ/, "pa"],
    [/^ぴ/, "pi"],
    [/^ぷ/, "pu"],
    [/^ぺ/, "pe"],
    [/^ぽ/, "po"],

    [/^ー/, "–"],

    [/^っ/, "+tu", true],
    [/^ゃ/, "+ya", true],
    [/^ゅ/, "+yu", true],
    [/^ょ/, "+yo", true],
    [/^ぁ/, "+a", true],
    [/^ぃ/, "+i", true],
    [/^ぅ/, "+u", true],
    [/^ぇ/, "+e", true],
    [/^ぉ/, "+o", true],

    [/^[\S\s]/, "?"],
];
