/**
 * @type {([RegExp, string] | [RegExp, string, true])[]}
 */
export default [
    [/^a/i, "あ"],
    [/^i/i, "い"],
    [/^u/i, "う"],
    [/^e/i, "え"],
    [/^o/i, "お"],

    [/^ka/i, "か"],
    [/^ki/i, "き"],
    [/^ku/i, "く"],
    [/^ke/i, "け"],
    [/^ko/i, "こ"],

    [/^sa/i, "さ"],
    [/^si/i, "し"],
    [/^shi/i, "し"],
    [/^su/i, "す"],
    [/^se/i, "せ"],
    [/^so/i, "そ"],

    [/^ta/i, "た"],
    [/^ti/i, "ち"],
    [/^chi/i, "ち"],
    [/^tu/i, "つ"],
    [/^tsu/i, "つ"],
    [/^te/i, "て"],
    [/^to/i, "と"],

    [/^na/i, "な"],
    [/^ni/i, "に"],
    [/^nu/i, "ぬ"],
    [/^ne/i, "ね"],
    [/^no/i, "の"],

    [/^ha/i, "は"],
    [/^hi/i, "ひ"],
    [/^hu/i, "ふ"],
    [/^fa/i, "ふぁ"],
    [/^fi/i, "ふぃ"],
    [/^fu/i, "ふ"],
    [/^fe/i, "ふぇ"],
    [/^fo/i, "ふぉ"],
    [/^he/i, "へ"],
    [/^ho/i, "ほ"],

    [/^ma/i, "ま"],
    [/^mi/i, "み"],
    [/^mu/i, "む"],
    [/^me/i, "め"],
    [/^mo/i, "も"],

    [/^ya/i, "や"],
    [/^yu/i, "ゆ"],
    [/^yo/i, "よ"],

    [/^ra/i, "ら"],
    [/^ri/i, "り"],
    [/^ru/i, "る"],
    [/^re/i, "れ"],
    [/^ro/i, "ろ"],

    [/^wa/i, "わ"],
    [/^wo/i, "を"],

    [/^whi/i, "うぃ"],
    [/^wi/i, "うぃ"],
    [/^whe/i, "うぇ"],
    [/^we/i, "うぇ"],

    [/^va/i, "ゔぁ"],
    [/^vi/i, "ゔぃ"],
    [/^vu/i, "ゔ"],
    [/^ve/i, "ゔぇ"],
    [/^vo/i, "ゔぉ"],

    [/^ga/i, "が"],
    [/^gi/i, "ぎ"],
    [/^gu/i, "ぐ"],
    [/^ge/i, "げ"],
    [/^go/i, "ご"],

    [/^za/i, "ざ"],
    [/^zi/i, "じ"],
    [/^ji/i, "じ"],
    [/^zu/i, "ず"],
    [/^ze/i, "ぜ"],
    [/^zo/i, "ぞ"],

    [/^da/i, "だ"],
    [/^di/i, "ぢ"],
    [/^dzi/i, "ぢ"],
    [/^du/i, "づ"],
    [/^dzu/i, "づ"],
    [/^de/i, "で"],
    [/^do/i, "ど"],

    [/^ba/i, "ば"],
    [/^bi/i, "び"],
    [/^bu/i, "ぶ"],
    [/^be/i, "べ"],
    [/^bo/i, "ぼ"],

    [/^pa/i, "ぱ"],
    [/^pi/i, "ぴ"],
    [/^pu/i, "ぷ"],
    [/^pe/i, "ぺ"],
    [/^po/i, "ぽ"],

    [/^kya/i, "きゃ"],
    [/^kyu/i, "きゅ"],
    [/^kye/i, "きぇ"],
    [/^kyo/i, "きょ"],

    [/^sya/i, "しゃ"],
    [/^sha/i, "しゃ"],
    [/^syu/i, "しゅ"],
    [/^shu/i, "しゅ"],
    [/^sye/i, "しぇ"],
    [/^she/i, "しぇ"],
    [/^syo/i, "しょ"],
    [/^sho/i, "しょ"],

    [/^tya/i, "ちゃ"],
    [/^cha/i, "ちゃ"],
    [/^tyu/i, "ちゅ"],
    [/^chu/i, "ちゅ"],
    [/^tye/i, "ちぇ"],
    [/^che/i, "ちぇ"],
    [/^tyo/i, "ちょ"],
    [/^cho/i, "ちょ"],

    [/^tsa/i, "つぁ"],
    [/^tsi/i, "つぃ"],
    [/^tse/i, "つぇ"],
    [/^tso/i, "つぉ"],

    [/^nya/i, "にゃ"],
    [/^nyu/i, "にゅ"],
    [/^nye/i, "にぇ"],
    [/^nyo/i, "にょ"],

    [/^hya/i, "ひゃ"],
    [/^hyu/i, "ひゅ"],
    [/^hye/i, "ひぇ"],
    [/^hyo/i, "ひょ"],

    [/^fya/i, "ふゃ"],
    [/^fyu/i, "ふゅ"],
    [/^fyo/i, "ふょ"],

    [/^mya/i, "みゃ"],
    [/^myu/i, "みゅ"],
    [/^mye/i, "みぇ"],
    [/^myo/i, "みょ"],

    [/^rya/i, "りゃ"],
    [/^ryu/i, "りゅ"],
    [/^rye/i, "りぇ"],
    [/^ryo/i, "りょ"],

    [/^wya/i, "うゃ"],
    [/^wyu/i, "うゅ"],
    [/^wyo/i, "うょ"],

    [/^vya/i, "ゔゃ"],
    [/^vyu/i, "ゔゅ"],
    [/^vyo/i, "ゔょ"],

    [/^gya/i, "ぎゃ"],
    [/^gyu/i, "ぎゅ"],
    [/^gye/i, "ぎぇ"],
    [/^gyo/i, "ぎょ"],

    [/^zya/i, "じゃ"],
    [/^ja/i, "じゃ"],
    [/^zyu/i, "じゅ"],
    [/^ju/i, "じゅ"],
    [/^zye/i, "じぇ"],
    [/^je/i, "じぇ"],
    [/^zyo/i, "じょ"],
    [/^jo/i, "じょ"],

    [/^bya/i, "びゃ"],
    [/^byu/i, "びゅ"],
    [/^bye/i, "びぇ"],
    [/^byo/i, "びょ"],

    [/^pya/i, "ぴゃ"],
    [/^pyu/i, "ぴゅ"],
    [/^pye/i, "ぴぇ"],
    [/^pyo/i, "ぴょ"],

    [/^n[\.']?/i, "ん"],

    [/^(?:x|[^-\p{L}])a/iu, "ぁ", true],
    [/^(?:x|[^-\p{L}])i/iu, "ぃ", true],
    [/^(?:x|[^-\p{L}])u/iu, "ぅ", true],
    [/^(?:x|[^-\p{L}])e/iu, "ぇ", true],
    [/^(?:x|[^-\p{L}])o/iu, "ぉ", true],

    [/^(?:x|[^-\p{L}])ya/iu, "ゃ", true],
    [/^(?:x|[^-\p{L}])yu/iu, "ゅ", true],
    [/^(?:x|[^-\p{L}])yo/iu, "ょ", true],

    [/^(?:x|[^-\p{L}])tu/iu, "っ"],

    [/^-/i, "ー"],

    [/^([a-z])(?=\1)/i, "っ"],

    [/^[\S\s]/, "？"],
];
